** In-place swap

#+BEGIN_SRC python
def swap_int(a, b):
    a = a ^ b
    b = a ^ b
    a = b ^ a
    return a, b

return swap_int(2, 1)
#+END_SRC

#+RESULTS:
| 1 | 2 |
